#+TITLE: Python学习笔记
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil
#+LATEX_CLASS: latex-doc
#+PAGE_TAGS: python

*** 属性
#+BEGIN_SRC python :results output :exports both
  def sum_args(*nums):
      '''accept arbitrary numerical arguments and return their sum'''
      return sum(nums)

  print sum_args.__name__
  print sum_args.__doc__
  print sum_args(1, 2, 3)
#+END_SRC

#+RESULTS:
: sum_args
: accept arbitrary numerical arguments and return their sum
: 6

*** 生成器
#+BEGIN_SRC python
  yield expression
#+END_SRC

#+BEGIN_SRC python :results output :exports both
  def updown(n):
      for x in range(n):
          yield x
      for x in range(n - 1, -1, -1):
          yield x
  for i in updown(10):
      print i,
#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9 9 8 7 6 5 4 3 2 1 0

*** 循环分支
下面语句的else表示完整遍历了循环，无论怎样，看上去很怪。
从形式上看，没有执行循环去访问else更加合理。
#+BEGIN_SRC python :exports both :results output
while 0:
    pass
else:
    print "over all"
#+END_SRC

#+RESULTS:
: over all

*** 慎用 =__del__=
文章 [[http://www.708luo.com/posts/2015/04/python-del-method/][慎用python的__del__方法]] 比较详细分析了这个缺陷。
=__del__= 相当于C语言中的析构函数，但是问题是它不一定被调用。
也就是说如果你实现了 =__del__= 方法就不能出现循环引用，
否则垃圾回收器将因为不知道释放顺序而放弃释放。
下面是一个示例。

#+BEGIN_SRC python :exports both :results output
class A(object):
    def __init__(self, parent):
        print "A init"
        self.parent = parent

    def __del__(self):
        print "A del"

class B(object):
    def __init__(self):
        print "B init"
        self.child = A(self)

    def __del__(self):
        print "B del"

b = B()
#+END_SRC

#+RESULTS:
: B init
: A init

就凭这一点，程序员应该不要去实现 =__del__= 函数，
当然这个问题应该归罪于Python本身，既然有这么严重的问题，
就不应该给用户提供接口。

